---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.InvalidPenNumber
source: html/d478c0a3-6a29-0b39-365f-1cc9394ab30b.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.InvalidPenNumber Property

The invalidPenNumber for clearing line weight overrides.

## Syntax (C#)
```csharp
public static int InvalidPenNumber { get; }
```